app/views/users/show.html.erb

                    チケット：
                    <strong><%= link_to( Event.find(Ticket.find(l.ticket_id).event_id).name, event_path( Ticket.find(l.ticket_id).event_id), class: "hl" ) %></strong>
                     - <%= Ticket.find(l.ticket_id).kind %><br>
                    枚数：<%= l.quantity %>枚　購入者：<%= User.find(l.user_id).name %><br>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]