app/views/shared/_nav.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]
---
<div class="p">最近見たチケット</div>
<a href="/events/<%= cookies[:recentview] %>"><%= Event.find(cookies[:recentview]).name %></a>