app/views/events/show.html.erb

        <div class="mini-title">場所</div>
        <%= Place.find( @e.place_id ).area %>・<%= Place.find( @e.place_id ).pref %>
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 1]]