app/controllers/events_controller.rb

    def top
        @events = Event.order("created_at").limit(5)
---
SELECT  "events".* FROM "events"  ORDER BY created_at LIMIT 5

    def search
        cookies[:recentsearch] = params[:q]
        @events = Event.search(params[:q], params[:term])
        if( !params[:term] || params[:term].length == 0 )
            @asideTitle = "「"+params[:q]+"」の検索結果("+@events.count.to_s+"件)"
---
SELECT "events".* FROM "events" WHERE (name LIKE '%a%' OR artist LIKE '%a%'OR hall LIKE '%a%') AND (date LIKE '%2018-12-07%')  ORDER BY created_at
SELECT COUNT(*) FROM "events" WHERE (name LIKE '%a%' OR artist LIKE '%a%'OR hall LIKE '%a%') AND (date LIKE '%2018-12-07%')

    def index
        @events = Event.order("created_at")
---
SELECT "events".* FROM "events"  ORDER BY created_at

    def show
        cookies[:recentview] = params[:id]
        @e = Event.find(params[:id])
        @tickets = Ticket.where(event_id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ?  [["event_id", 1]]