app/controllers/logs_controller.rb

    def new
        if( params[:ticket_id].present? )
            @ticket = Ticket.find(params[:ticket_id])
            @event = Event.find( @ticket.event_id )
            @logs = Log.where( ticket_id: @ticket.id )
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "logs".* FROM "logs" WHERE "logs"."ticket_id" = ? LIMIT 1  [["ticket_id", 2]]

    def create
        params[:log][:user_id] = account.id

        if( Ticket.find(params[:log][:ticket_id]).total - Log.where( ticket_id: params[:log][:ticket_id] ).sum(:quantity) - params[:log][:quantity].to_i < 0 )
            redirect_to( root_path(), notice: "枚数が不足しているため購入処理が完了できませんでした。" )
            return
        end

        @log = Log.new(params[:log])
        if( @log.save )
---
INSERT INTO "logs" ("quantity", "ticket_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 100], ["ticket_id", 5], ["user_id", 1], ["created_at", "2018-12-20 09:19:17.317997"], ["updated_at", "2018-12-20 09:19:17.317997"]]