app/controllers/tickets_controller.rb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @ticket = Ticket.find(params[:id])
        @event = Event.find( @ticket.event_id )