app/controllers/users_controller.rb

    def index
        if( !account.present? || !account.admin )
            flash.notice = "アクセス権限がありません。"
            redirect_to( :root )
        end
        @users = User.order("created_at")
---
SELECT "users".* FROM "users"  ORDER BY created_at

    def create
        @user = User.new(params[:user])
        if( @user.save )
---
INSERT INTO "users" ("name", "tel", "password", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "なまえ"], ["tel", "でんわ"], ["password", "ぱす"], ["admin", "t"], ["created_at", "2018-12-11 07:43:46.545583"], ["updated_at", "2018-12-11 07:43:46.545583"]]

    def show
        if( !account.present? || account.id.to_s != params[:id] )
            if( !account.admin )
                flash.notice = "アクセス権限がありません。"
                redirect_to( :root )
            end
        end
        @user = User.find(params[:id])
        @logs = Log.order("created_at")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "logs".* FROM "logs"  ORDER BY created_at